NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG24/EFR32BG24A020F1024IM40.svd
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x07000040</resetValue>
          <resetMask>0x8707FF7D</resetMask>
          <fields>
            <field>
              <name>BUFOUTFREEZE</name>
              <description>Freeze BUFOUT Controls</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEEPWARM</name>
              <description>Keep Warm</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM23ONDEMAND</name>
              <description>On-demand During EM23</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEXI2GNDANA</name>
              <description>Force XI Pin to Ground</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled (not pulled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled (pulled)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEXO2GNDANA</name>
              <description>Force XO Pin to Ground</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled (not pulled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled (pulled)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCECTUNEMAX</name>
              <description>Force Tuning Cap to Max Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSSTATUSSEL0</name>
              <description>PRS Status 0 Output Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>PRS mux outputs 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENS</name>
                  <description>PRS mux outputs enabled status</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COREBIASOPTRDY</name>
                  <description>PRS mux outputs core bias optimization ready status</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY</name>
                  <description>PRS mux outputs ready status</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSRDY</name>
                  <description>PRS mux outputs PRS ready status</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFOUTRDY</name>
                  <description>PRS mux outputs BUFOUT ready status</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWREQ</name>
                  <description>PRS mux outputs oscillator requested by digital clock status</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSHWREQ</name>
                  <description>PRS mux outputs oscillator requested by PRS request status</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFOUTHWREQ</name>
                  <description>PRS mux outputs oscillator requested by BUFOUT request status</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSSTATUSSEL1</name>
              <description>PRS Status 1 Output Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>PRS mux outputs 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENS</name>
                  <description>PRS mux outputs enabled status</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COREBIASOPTRDY</name>
                  <description>PRS mux outputs core bias optimization ready status</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY</name>
                  <description>PRS mux outputs ready status</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSRDY</name>
                  <description>PRS mux outputs PRS ready status</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFOUTRDY</name>
                  <description>PRS mux outputs BUFOUT ready status</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWREQ</name>
                  <description>PRS mux outputs oscillator requested by digital clock status</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSHWREQ</name>
                  <description>PRS mux outputs oscillator requested by PRS request status</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFOUTHWREQ</name>
                  <description>PRS mux outputs oscillator requested by BUFOUT request status</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEEN</name>
              <description>Force Digital Clock Request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEENPRS</name>
              <description>Force PRS Oscillator Request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEENBUFOUT</name>
              <description>Force BUFOUT Request</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISONDEMAND</name>
              <description>Disable On-demand For Digital Clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISONDEMANDPRS</name>
              <description>Disable On-demand For PRS</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISONDEMANDBUFOUT</name>
              <description>Disable On-demand For BUFOUT</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFOUTTRIM</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>VTRTRIMANA</name>
              <description>BUFOUT Reference Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFOUTCTRL</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00643C15</resetValue>
          <resetMask>0xC0FFFFFF</resetMask>
          <fields>
            <field>
              <name>XOUTBIASANA</name>
              <description>Driver Bias Current</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XOUTCFANA</name>
              <description>Buffer Gain</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XOUTGMANA</name>
              <description></description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAKDETTHRESANA</name>
              <description>Peak Detector Threshold for XOUT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V105MV</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V132MV</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V157MV</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V184MV</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V210MV</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V236MV</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V262MV</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V289MV</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V315MV</name>
                  <description></description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V341MV</name>
                  <description></description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V367MV</name>
                  <description></description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V394MV</name>
                  <description></description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V420MV</name>
                  <description></description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V446MV</name>
                  <description></description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V472MV</name>
                  <description></description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V499MV</name>
                  <description></description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUTCTUNE</name>
              <description>Tuning Cap Change Timeout</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>T2US</name>
                  <description>The tuning cap change timeout is set to 2 us minimum.  The maximum can be +40%.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T5US</name>
                  <description>The tuning cap change timeout is set to 5 us minimum.  The maximum can be +40%.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T10US</name>
                  <description>The tuning cap change timeout is set to 10 us minimum.  The maximum can be +40%.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T16US</name>
                  <description>The tuning cap change timeout is set to 16 us minimum.  The maximum can be +40%.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T21US</name>
                  <description>The tuning cap change timeout is set to 21 us minimum.  The maximum can be +40%.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T26US</name>
                  <description>The tuning cap change timeout is set to 26 us minimum.  The maximum can be +40%.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T31US</name>
                  <description>The tuning cap change timeout is set to 31 us minimum.  The maximum can be +40%.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T42US</name>
                  <description>The tuning cap change timeout is set to 42 us minimum.  The maximum can be +40%.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T52US</name>
                  <description>The tuning cap change timeout is set to 52 us minimum.  The maximum can be +40%.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T63US</name>
                  <description>The tuning cap change timeout is set to 63 us minimum.  The maximum can be +40%.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T83US</name>
                  <description>The tuning cap change timeout is set to 83 us minimum.  The maximum can be +40%.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T104US</name>
                  <description>The tuning cap change timeout is set to 104 us minimum.  The maximum can be +40%.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T208US</name>
                  <description>The tuning cap change timeout is set to 208 us minimum.  The maximum can be +40%.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T313US</name>
                  <description>The tuning cap change timeout is set to 313 us minimum.  The maximum can be +40%.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T521US</name>
                  <description>The tuning cap change timeout is set to 521 us minimum.  The maximum can be +40%.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T938US</name>
                  <description>The tuning cap change timeout is set to 938 us minimum.  The maximum can be +40%.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUTSTARTUP</name>
              <description>Oscillator Startup Timeout</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>T42US</name>
                  <description>The oscillator startup timeout is set to 42 us minimum.  The maximum can be +40%.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T83US</name>
                  <description>The oscillator startup timeout is set to 83 us minimum.  The maximum can be +40%.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T108US</name>
                  <description>The oscillator startup timeout is set to 108 us minimum.  The maximum can be +40%.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T133US</name>
                  <description>The oscillator startup timeout is set to 133 us minimum.  The maximum can be +40%.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T158US</name>
                  <description>The oscillator startup timeout is set to 158 us minimum.  The maximum can be +40%.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T183US</name>
                  <description>The oscillator startup timeout is set to 183 us minimum.  The maximum can be +40%.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T208US</name>
                  <description>The oscillator startup timeout is set to 208 us minimum.  The maximum can be +40%.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T233US</name>
                  <description>The oscillator startup timeout is set to 233 us minimum.  The maximum can be +40%.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T258US</name>
                  <description>The oscillator startup timeout is set to 258 us minimum.  The maximum can be +40%.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T283US</name>
                  <description>The oscillator startup timeout is set to 283 us minimum.  The maximum can be +40%.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T333US</name>
                  <description>The oscillator startup timeout is set to 333 us minimum.  The maximum can be +40%.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T375US</name>
                  <description>The oscillator startup timeout is set to 375 us minimum.  The maximum can be +40%.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T417US</name>
                  <description>The oscillator startup timeout is set to 417 us minimum.  The maximum can be +40%.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T458US</name>
                  <description>The oscillator startup timeout is set to 458 us minimum.  The maximum can be +40%.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T500US</name>
                  <description>The oscillator startup timeout is set to 500 us minimum.  The maximum can be +40%.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T667US</name>
                  <description>The oscillator startup timeout is set to 667 us minimum.  The maximum can be +40%.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINIMUMSTARTUPDELAY</name>
              <description>Minimum Startup Delay</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
